In [2]:
import pandas as pd
import numpy as np

In [3]:
csl_data = pd.read_csv("./data/impute.csv", index_col=[0])

In [4]:
csl_data.head()

       POB  YEAR MIN MAX MINEXPT MINAWORK MINEWORK  NEXTYEAR  BIRTHPL
1  Alabama  1914  NR  NR      NR       NR       NR      1917        1
2  Alabama  1915  NR  NR      NR       NR       NR      1917        1
3  Alabama  1916  NR  NR      NR       NR       NR      1917        1
4  Alabama  1917   8  16       6       12       NR      1921        1
5  Alabama  1918   8  16       6       12       NR      1921        1

In [5]:
csl_data.shape

(3185, 9)

MIN = compulsory attendance minimum

MAX = compulsory attendance maximum

MINEXPT = minimum shooling to dropout

MINAWORK = minimum age to work

MINEWORK = minimum education to work

"M" = missing

"NR" = not restricted.

req_sch = ca

In [6]:
csl_data = csl_data.replace(to_replace= "NR", value= 0 )

In [7]:
# renaming variables
csl_data.rename(columns = {"MINEXPT": "req_sch",
                             "MINAWORK": "work_age",
                             "MINEWORK": "work_sch"}, inplace=True)
csl_data.head()

       POB  YEAR MIN MAX req_sch work_age work_sch  NEXTYEAR  BIRTHPL
1  Alabama  1914   0   0       0        0        0      1917        1
2  Alabama  1915   0   0       0        0        0      1917        1
3  Alabama  1916   0   0       0        0        0      1917        1
4  Alabama  1917   8  16       6       12        0      1921        1
5  Alabama  1918   8  16       6       12        0      1921        1

## Creating Instruments

In [9]:
# for ca
ca = []

for i, j, k in zip(csl_data.MIN, csl_data.MAX, csl_data.req_sch):
    if (i != 0) and (j != 0 ):
        ca.append(max(int(j)-int(i), int(k)))
    elif (i == 0) or (j == 0 ):
        ca.append(max(0, int(k)))

csl_data["ca"] = ca

# for cl
cl =  []

for i, j, k, l in zip(csl_data.MIN, csl_data.MAX, csl_data.work_sch, csl_data.work_age):
    if (i != 0):
        cl.append(max(int(l)-int(i), int(k)))
    elif (i == 0):
        cl.append(max(0, int(k)))

csl_data["cl"] = cl

### Creating Dummies

In [10]:
csl_data["ca8"] = csl_data.ca.apply(lambda row: 1 if row <= 8 else 0)
csl_data["ca9"] = csl_data.ca.apply(lambda row: 1 if row == 9 else 0)
csl_data["ca10"] = csl_data.ca.apply(lambda row: 1 if row == 10 else 0)
csl_data["ca11"] = csl_data.ca.apply(lambda row: 1 if row >= 11 else 0)

csl_data["cl6"] = csl_data.cl.apply(lambda row: 1 if row <= 6 else 0)
csl_data["cl7"] = csl_data.cl.apply(lambda row: 1 if row == 7 else 0)
csl_data["cl8"] = csl_data.cl.apply(lambda row: 1 if row == 8 else 0)
csl_data["cl9"] = csl_data.cl.apply(lambda row: 1 if row >= 9 else 0)

In [11]:
csl_data.to_csv("./data/instruments_clean.csv")